Revit 2027 API
PointNode Class
 An output node that represents a 3D point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.PointNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointNode : ModelCurveNode
Public Class PointNode
	Inherits ModelCurveNode
public ref class PointNode : public ModelCurveNode
type PointNode =
    class
        inherit ModelCurveNode
    end
The PointNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LineProperties |  Access to the line (pen) properties of the curve being drawn
(Inherited from ModelCurveNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPoint |  Returns the point object corresponding to the node.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnPoint(PointNode).
See Also
Reference
Autodesk.Revit.DB Namespace